Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotDuplicateDesignOption Property
 Can't duplicate Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDuplicateDesignOption { get; }
Visual Basic
Public Shared ReadOnly Property CannotDuplicateDesignOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDuplicateDesignOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace